Glen-collab/polly-connect/firmware/polly-s3-wakeword/sdkconfig.defaults
# ESP32-S3-WROOM-1-N16R8 specific config

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash - 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - 8MB Octal
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# Audio / I2S
CONFIG_I2S_ISR_IRAM_SAFE=y

# Console over native USB-Serial-JTAG (Paul's v2 board has no UART bridge —
# this routes logs to COM3 so `idf.py monitor` works on the new board)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Performance
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# HTTP Server (captive portal)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# OTA updates
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
